In [1]:
%matplotlib inline

import numpy as np
import scipy as sp
import matplotlib as mpl
import matplotlib.cm as cm
import matplotlib.pyplot as plt
import pandas as pd
import time
pd.set_option('display.width', 500)
pd.set_option('display.max_columns', 100)
pd.set_option('display.notebook_repr_html', True)
import seaborn as sns
sns.set_style("whitegrid")
sns.set_context("poster")

In [2]:
# Define our schema in SQL

ourschema="""
DROP TABLE IF EXISTS "candidates";
DROP TABLE IF EXISTS "contributors";
CREATE TABLE "candidates" (
    "id" INTEGER PRIMARY KEY  NOT NULL ,
    "first_name" VARCHAR,
    "last_name" VARCHAR,
    "middle_name" VARCHAR,
    "party" VARCHAR NOT NULL
);
CREATE TABLE "contributors" (
    "id" INTEGER PRIMARY KEY  AUTOINCREMENT  NOT NULL,
    "last_name" VARCHAR,
    "first_name" VARCHAR,
    "middle_name" VARCHAR,
    "street_1" VARCHAR,
    "street_2" VARCHAR,
    "city" VARCHAR,
    "state" VARCHAR,
    "zip" VARCHAR,
    "amount" INTEGER,
    "date" DATETIME,
    "candidate_id" INTEGER NOT NULL,
    FOREIGN KEY(candidate_id) REFERENCES candidates(id)
);
"""

In [3]:
# dbapi2 is API of SQLITE. Connect and get a DBAPI2 connection.
from sqlite3 import dbapi2 as sq3
import os
PATHSTART="."
def get_db(dbfile):
    sqlite_db = sq3.connect(os.path.join(PATHSTART, dbfile))
    return sqlite_db

In [4]:
# Use predefined schema to init database.
def init_db(dbfile, schema):
    """Creates the database tables."""
    db = get_db(dbfile)
    db.cursor().executescript(schema)
    db.commit()
    return db

In [5]:
dfcand=pd.read_csv("candidates.txt", sep='|')
dfcand

    id   first_name   last_name middle_name party
0   33       Joseph       Biden         NaN     D
1   36       Samuel   Brownback         NaN     R
2   34      Hillary     Clinton          R.     D
3   39  Christopher        Dodd          J.     D
4   26         John     Edwards         NaN     D
5   22      Rudolph    Giuliani         NaN     R
6   24         Mike      Gravel         NaN     D
7   16         Mike    Huckabee         NaN     R
8   30       Duncan      Hunter         NaN     R
9   31       Dennis    Kucinich         NaN     D
10  37         John      McCain         NaN     R
11  20       Barack       Obama         NaN     D
12  32          Ron        Paul         NaN     R
13  29         Bill  Richardson         NaN     D
14  35         Mitt      Romney         NaN     R
15  38          Tom    Tancredo         NaN     R
16  41         Fred    Thompson          D.     R

In [6]:
dfcwci=pd.read_csv("contributors_with_candidate_id.txt", sep="|")
dfcwci.head()

   id last_name first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
0 NaN      Agee     Steven         NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
1 NaN    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   250.0  2007-05-16            16
2 NaN    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566    50.0  2007-06-18            16
3 NaN    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   100.0  2007-06-21            16
4 NaN      Akin    Charles         NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16

In [7]:
del dfcwci['id']
dfcwci.head()

  last_name first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
0      Agee     Steven         NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
1    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   250.0  2007-05-16            16
2    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566    50.0  2007-06-18            16
3    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   100.0  2007-06-21            16
4      Akin    Charles         NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16

In [8]:
# init the database
db=init_db("cancont.db", ourschema)

In [9]:
# Populating with Pandas
dfcand.to_sql("candidates", db, if_exists="append", index=False)
dfcwci.to_sql("contributors", db, if_exists="append", index=False)
dfcwci.shape

(175, 11)

In [10]:
sel="""
SELECT * FROM candidates;
"""
# Execute sel , select all information in database
c=db.cursor().execute(sel)

In [11]:
c.fetchall()

[(16, u'Mike', u'Huckabee', None, u'R'),
 (20, u'Barack', u'Obama', None, u'D'),
 (22, u'Rudolph', u'Giuliani', None, u'R'),
 (24, u'Mike', u'Gravel', None, u'D'),
 (26, u'John', u'Edwards', None, u'D'),
 (29, u'Bill', u'Richardson', None, u'D'),
 (30, u'Duncan', u'Hunter', None, u'R'),
 (31, u'Dennis', u'Kucinich', None, u'D'),
 (32, u'Ron', u'Paul', None, u'R'),
 (33, u'Joseph', u'Biden', None, u'D'),
 (34, u'Hillary', u'Clinton', u'R.', u'D'),
 (35, u'Mitt', u'Romney', None, u'R'),
 (36, u'Samuel', u'Brownback', None, u'R'),
 (37, u'John', u'McCain', None, u'R'),
 (38, u'Tom', u'Tancredo', None, u'R'),
 (39, u'Christopher', u'Dodd', u'J.', u'D'),
 (41, u'Fred', u'Thompson', u'D.', u'R')]

In [12]:
rem="""
DELETE FROM candidates;
"""
# Delete all information in database
c=db.cursor().execute(rem)
db.commit()

In [13]:
c.fetchall()

[]

In [17]:
# query
# SQL format
dfcwci.query("state=='VA' & amount < 400")

     last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id
27    Buckheit      Bruce         NaN                8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20
77   Ranganath      Anoop         NaN           2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32
88   Perreault     Louise         NaN    503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32
145    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [15]:
# Pandas format
dfcwci[(dfcwci.state=='VA') & (dfcwci.amount < 400)]

     last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id
27    Buckheit      Bruce         NaN                8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20
77   Ranganath      Anoop         NaN           2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32
88   Perreault     Louise         NaN    503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32
145    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [22]:
# make_frame function transform query data into datafrme of pandas, without this function, the output is CSV format

#Define the column of table, 'contributors' is the tabel name
cont_cols = [e[1] for e in make_query("PRAGMA table_info(contributors);")]
cont_cols

def make_frame(list_of_tuples, legend=cont_cols):
    framelist=[]
    for i, cname in enumerate(legend):
        framelist.append((cname,[e[i] for e in list_of_tuples]))
    return pd.DataFrame.from_items(framelist)

# Must select the same table as cont_cols
out=make_query("SELECT * FROM contributors WHERE state='VA' AND amount < 400;")
print out
make_frame(out)

[(28, u'Buckheit', u'Bruce', None, u'8904 KAREN DR', None, u'FAIRFAX', u'VA', u'220312731', 100, u'2007-09-19', 20), (78, u'Ranganath', u'Anoop', None, u'2507 Willard Drive', None, u'Charlottesville', u'VA', u'22903', -100, u'2008-04-21', 32), (89, u'Perreault', u'Louise', None, u'503 Brockridge Hunt Drive', None, u'Hampton', u'VA', u'23666', -34.08, u'2008-04-21', 32), (146, u'ABDELLA', u'THOMAS', u'M.', u'4231 MONUMENT WALL WAY #340', None, u'FAIRFAX', u'VA', u'220308440', 50, u'2007-09-30', 35)]

    id  last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id
0   28   Buckheit      Bruce        None                8904 KAREN DR     None          FAIRFAX    VA  220312731  100.00  2007-09-19            20
1   78  Ranganath      Anoop        None           2507 Willard Drive     None  Charlottesville    VA      22903 -100.00  2008-04-21            32
2   89  Perreault     Louise        None    503 Brockridge Hunt Drive     None          Hampton    VA      23666  -34.08  2008-04-21            32
3  146    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340     None          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [23]:
# Different language of python and SQL in 'is null'

out=make_query("SELECT * FROM contributors WHERE state IS NULL;")
make_frame(out)

    id last_name first_name middle_name       street_1 street_2        city state   zip  amount        date  candidate_id
0  126    BOURNE     TRAVIS        None  LAGE KAART 77     None  BRASSCHATT  None  2930    -500  2008-11-20            35

In [24]:
dfcwci[dfcwci.state.isnull()]

    last_name first_name middle_name       street_1 street_2        city state   zip  amount        date  candidate_id
125    BOURNE     TRAVIS         NaN  LAGE KAART 77      NaN  BRASSCHATT   NaN  2930  -500.0  2008-11-20            35

In [25]:
# Different language of python and SQL in 'in'

out=make_query("SELECT * FROM contributors WHERE state IN ('VA','WA');")
make_frame(out).head(10)

    id  last_name first_name middle_name                      street_1 street_2             city state        zip  amount        date  candidate_id
0    1       Agee     Steven        None        549 Laurel Branch Road     None            Floyd    VA      24091  500.00  2007-06-30            16
1   28   Buckheit      Bruce        None                 8904 KAREN DR     None          FAIRFAX    VA  220312731  100.00  2007-09-19            20
2   63      BURKE    SUZANNE          M.                 3401 EVANSTON     None          SEATTLE    WA  981038677 -700.00  2008-03-05            22
3   78  Ranganath      Anoop        None            2507 Willard Drive     None  Charlottesville    VA      22903 -100.00  2008-04-21            32
4   89  Perreault     Louise        None     503 Brockridge Hunt Drive     None          Hampton    VA      23666  -34.08  2008-04-21            32
5  101   Aaronson    Rebecca        None  2000 Village Green Dr Apt 12     None       Mill Creek    WA  980125787  100.00  2008-02-08            34
6  107   Aaronson    Rebecca        None  2000 Village Green Dr Apt 12     None       Mill Creek    WA  980125787  100.00  2008-02-14            34
7  146    ABDELLA     THOMAS          M.   4231 MONUMENT WALL WAY #340     None          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [26]:
dfcwci[dfcwci.state.isin(['VA','WA'])].head(10)

     last_name first_name middle_name                      street_1 street_2             city state        zip  amount        date  candidate_id
0         Agee     Steven         NaN        549 Laurel Branch Road      NaN            Floyd    VA      24091  500.00  2007-06-30            16
27    Buckheit      Bruce         NaN                 8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20
62       BURKE    SUZANNE          M.                 3401 EVANSTON      NaN          SEATTLE    WA  981038677 -700.00  2008-03-05            22
77   Ranganath      Anoop         NaN            2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32
88   Perreault     Louise         NaN     503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32
100   Aaronson    Rebecca         NaN  2000 Village Green Dr Apt 12      NaN       Mill Creek    WA  980125787  100.00  2008-02-08            34
106   Aaronson    Rebecca         NaN  2000 Village Green Dr Apt 12      NaN       Mill Creek    WA  980125787  100.00  2008-02-14            34
145    ABDELLA     THOMAS          M.   4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [27]:
# Different language of python and SQL in 'BETWEEN AND'
out=make_query("SELECT * FROM contributors WHERE amount BETWEEN 10 AND 50;")
make_frame(out).head(10)

    id last_name first_name middle_name                    street_1 street_2           city state        zip  amount        date  candidate_id
0    3    Ahrens        Don        None        4034 Rennellwood Way     None     Pleasanton    CA      94566      50  2007-06-18            16
1   19     Ardle    William        None           412 Dakota Avenue     None    Springfield    OH      45504      50  2007-06-28            16
2   26   Buckler      Steve        None             24351 Armada Dr     None     Dana Point    CA  926291306      50  2007-07-30            20
3   27   Buckler      Steve        None             24351 Armada Dr     None     Dana Point    CA  926291306      25  2007-08-16            20
4   35      Buck    Barbara        None            1780 NE 138th St     None    North Miami    FL  331811316      50  2007-09-13            20
5   36      Buck    Barbara        None            1780 NE 138th St     None    North Miami    FL  331811316      50  2007-07-19            20
6   39  Buchanek  Elizabeth        None            7917 Kentbury Dr     None       Bethesda    MD  208144615      50  2007-09-30            20
7   50  Harrison       Ryan        None                 2247 3rd St     None       La Verne    CA  917504918      25  2007-07-26            20
8  102    Aarons     Elaine        None  481 Buck Island Rd Apt 17A  APT 17A  West Yarmouth    MA   26733300      25  2008-02-26            34
9  105     Aaron    Shirley        None              101 Cherry Ave     None         Havana    FL  323331311      50  2008-02-29            34

In [28]:
dfcwci.query("10 <= amount <= 50").head(10)

    last_name first_name middle_name                    street_1 street_2           city state        zip  amount        date  candidate_id
2      Ahrens        Don         NaN        4034 Rennellwood Way      NaN     Pleasanton    CA      94566    50.0  2007-06-18            16
18      Ardle    William         NaN           412 Dakota Avenue      NaN    Springfield    OH      45504    50.0  2007-06-28            16
25    Buckler      Steve         NaN             24351 Armada Dr      NaN     Dana Point    CA  926291306    50.0  2007-07-30            20
26    Buckler      Steve         NaN             24351 Armada Dr      NaN     Dana Point    CA  926291306    25.0  2007-08-16            20
34       Buck    Barbara         NaN            1780 NE 138th St      NaN    North Miami    FL  331811316    50.0  2007-09-13            20
35       Buck    Barbara         NaN            1780 NE 138th St      NaN    North Miami    FL  331811316    50.0  2007-07-19            20
38   Buchanek  Elizabeth         NaN            7917 Kentbury Dr      NaN       Bethesda    MD  208144615    50.0  2007-09-30            20
49   Harrison       Ryan         NaN                 2247 3rd St      NaN       La Verne    CA  917504918    25.0  2007-07-26            20
101    Aarons     Elaine         NaN  481 Buck Island Rd Apt 17A  APT 17A  West Yarmouth    MA   26733300    25.0  2008-02-26            34
104     Aaron    Shirley         NaN              101 Cherry Ave      NaN         Havana    FL  323331311    50.0  2008-02-29            34

In [29]:
# Different language of python and SQL in sort operation
out=make_query("SELECT * FROM contributors ORDER BY amount DESC;")
make_frame(out).head(10)

    id   last_name first_name middle_name                 street_1 street_2           city state        zip  amount        date  candidate_id
0   31      Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130  4600.0  2007-08-14            20
1  160       ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE     None  MIAMI SPRINGS    FL  331663832  2600.0  2008-01-25            37
2   14       Altes       R.D.        None          8600 Moody Road     None     Fort Smith    AR      72903  2300.0  2007-06-21            16
3   16     Anthony       John        None    211 Long Island Drive     None    Hot Springs    AR      71913  2300.0  2007-06-12            16
4   22       Baker      David        None   2550 Adamsbrooke Drive     None         Conway    AR      72034  2300.0  2007-04-11            16
5   29      Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130  2300.0  2007-08-14            20
6   34        Buck     Blaine           M             45 Eaton Ave     None         Camden    ME   48431752  2300.0  2007-09-30            20
7  136  ABRAMOWITZ       NIRA        None          411 HARBOR ROAD     None      SOUTHPORT    CT   68901376  2300.0  2007-09-14            35
8    6        Akin       Mike        None         181 Baywood Lane     None     Monticello    AR      71655  1500.0  2007-05-18            16
9   10       Allen    John D.        None   1052 Cannon Mill Drive     None  North Augusta    SC      29860  1300.0  2007-06-29            16

In [34]:
dfcwci.sort_values("amount", ascending=False).head(10)

      last_name first_name middle_name                 street_1 street_2           city state        zip  amount        date  candidate_id
30       Buckel      Linda         NaN            PO Box 683130      NaN      Park City    UT  840683130  4600.0  2007-08-14            20
159       ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE      NaN  MIAMI SPRINGS    FL  331663832  2600.0  2008-01-25            37
15      Anthony       John         NaN    211 Long Island Drive      NaN    Hot Springs    AR      71913  2300.0  2007-06-12            16
33         Buck     Blaine           M             45 Eaton Ave      NaN         Camden    ME   48431752  2300.0  2007-09-30            20
28       Buckel      Linda         NaN            PO Box 683130      NaN      Park City    UT  840683130  2300.0  2007-08-14            20
21        Baker      David         NaN   2550 Adamsbrooke Drive      NaN         Conway    AR      72034  2300.0  2007-04-11            16
13        Altes       R.D.         NaN          8600 Moody Road      NaN     Fort Smith    AR      72903  2300.0  2007-06-21            16
135  ABRAMOWITZ       NIRA         NaN          411 HARBOR ROAD      NaN      SOUTHPORT    CT   68901376  2300.0  2007-09-14            35
5          Akin       Mike         NaN         181 Baywood Lane      NaN     Monticello    AR      71655  1500.0  2007-05-18            16
174     ABRAHAM      SALEM          A.               P.O. BOX 7      NaN       CANADIAN    TX  790140007  1300.0  2008-01-30            37

In [35]:
# # Different language of python and SQL in SELECT-COLUMNS

out=make_query("SELECT first_name, amount FROM contributors;")
make_frame(out,['first_name', 'amount']).head(10)

  first_name  amount
0     Steven   500.0
1        Don   250.0
2        Don    50.0
3        Don   100.0
4    Charles   100.0
5       Mike  1500.0
6    Rebecca   500.0
7    Brittni   250.0
8    John D.  1000.0
9    John D.  1300.0

In [36]:
dfcwci[['first_name', 'amount']].head(10)

  first_name  amount
0     Steven   500.0
1        Don   250.0
2        Don    50.0
3        Don   100.0
4    Charles   100.0
5       Mike  1500.0
6    Rebecca   500.0
7    Brittni   250.0
8    John D.  1000.0
9    John D.  1300.0